InformationRegisters/КартинкиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КартинкиОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектТЗ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыДляКартинок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омКартинкиНаСервере/Ext/Module.bsl
Процедура СоздатьЭлементыИРеквизитыНаФорме(ТекущаяФорма, РодительскийЭлемент, ДополнительныеТипыФайлов = Ложь, НеОтображатьМеню = Ложь) Экспорт
	
	Если НЕ НеОтображатьМеню Тогда
		
		ЭлементГруппа 		= СоздатьГруппуКартинка(ТекущаяФорма, РодительскийЭлемент);
		ЭлементГруппаКнопки = СоздатьГруппуКнопки(ТекущаяФорма, ЭлементГруппа);
		СоздадьКомандуКартинкуИКнопку(ТекущаяФорма, ЭлементГруппаКнопки, "Добавить картинку", "КнопкаДобавитьКартинку");
		СоздатьКнопкуКартинки(ТекущаяФорма, ЭлементГруппаКнопки, "Сохранить", "КнопкаСохранитьКартинку");
		СоздатьКнопкуКартинки(ТекущаяФорма, ЭлементГруппаКнопки, "<<", "КартинкуВлево");
		СоздатьРеквизитИЭлемент(ТекущаяФорма, "ИмяКартинки_авто", ЭлементГруппаКнопки, "", ВидПоляФормы.ПолеНадписи);
		СоздатьКнопкуКартинки(ТекущаяФорма, ЭлементГруппаКнопки, ">>", "КартинкуВправо");
		
		Если РольДоступна("РедактированиеОбразцов") Тогда
			СоздатьКнопкуКартинки(ТекущаяФорма, ЭлементГруппаКнопки, "Удалить", "УдалитьКартинку");
		КонецЕсли;
		
		
	КонецЕсли;
	
	
	Если ДополнительныеТипыФайлов Тогда
		
		СоздатьРеквизитИЭлементPDF(ТекущаяФорма, "Картинка_pdf_авто", ЭлементГруппа, "");
		ТекущаяФорма.Элементы.Картинка_pdf_авто.Видимость = Ложь;	
		СоздатьРеквизитИЭлемент(ТекущаяФорма, "Картинка_ТД_авто", ЭлементГруппа, "", ВидПоляФормы.ПолеНадписи);
		ТекущаяФорма.Элементы.Картинка_ТД_авто.Видимость = Ложь;	
	
	КонецЕсли;
	
	ЭлементПоляКартинки = СоздатьРеквизитИЭлемент(ТекущаяФорма, "Картинка_авто", ЭлементГруппа, "", ВидПоляФормы.ПолеКартинки);

КонецПроцедуры

Процедура СоздатьКнопкуКартинки(ТекущаяФорма, ЭлементГруппа, Заголовок, ИмяКоманды)
	
	КнопкаДобавитьКартинка 				= ТекущаяФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭлементГруппа);
	КнопкаДобавитьКартинка.Заголовок 	= Заголовок;
	КнопкаДобавитьКартинка.ИмяКоманды 	= "ОбщаяКомандаКартинка";
	
КонецПроцедуры

Процедура СоздадьКомандуКартинкуИКнопку(ТекущаяФорма, ЭлементГруппа, Заголовок, ИмяКоманды)
	
	КомандаДобавитьКартинка 			= ТекущаяФорма.Команды.Добавить("ОбщаяКомандаКартинка");
	КомандаДобавитьКартинка.Заголовок 	= Заголовок;
	КомандаДобавитьКартинка.Действие 	= "ОбщаяКомандаКартинка";
	
	СоздатьКнопкуКартинки(ТекущаяФорма, ЭлементГруппа, Заголовок, ИмяКоманды);
	
КонецПроцедуры

Функция СоздатьГруппуКартинка(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКартинки 						= ТекущаяФорма.Элементы.Добавить("ГруппаКартинки_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКартинки.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКартинки.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКартинки.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКартинки.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	Возврат ГруппаКартинки;
	
КонецФункции

Функция СоздатьГруппуКнопки(ТекущаяФорма, РодительскийЭлемент)
	
	ГруппаКомментарий 						= ТекущаяФорма.Элементы.Добавить("ГруппаКартинкиКнопки_авто", Тип("ГруппаФормы"), РодительскийЭлемент);
	ГруппаКомментарий.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаКомментарий.Отображение 			= ОтображениеОбычнойГруппы.Нет;
	ГруппаКомментарий.ОтображатьЗаголовок 	= Ложь; 
	ГруппаКомментарий.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	Возврат ГруппаКомментарий;
	
КонецФункции
                          
Процедура СоздатьРеквизитИЭлементPDF(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа, Заголовок)

	ДобавляемыеРеквизиты = Новый Массив; 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(имяРеквизита, Новый ОписаниеТипов("ДокументPDF"))); 
	
    ТекущаяФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа, Заголовок, ВидПоляФормы.ПолеPDFДокумента);
	
КонецПроцедуры // СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

Функция СоздатьРеквизитИЭлемент(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа, Заголовок, ВидПоля)

	ДобавляемыеРеквизиты = Новый Массив; 
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(имяРеквизита, Новый ОписаниеТипов("Строка"))); 
	
    ТекущаяФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Возврат СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа, Заголовок, ВидПоля);
	
КонецФункции // СоздатьРеквизитДобавитьКомментарий(ТекущаяФорма)

Функция СоздатьЭлементФормы(ТекущаяФорма, ИмяРеквизита, ЭлементГруппа, Заголовок, ВидПоля)
	
	НовыйЭлемент 					= ТекущаяФорма.Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ЭлементГруппа);
	НовыйЭлемент.Заголовок			= Заголовок;
	НовыйЭлемент.Вид 				= ВидПоля;
	НовыйЭлемент.ПутьКДанным 		= ИмяРеквизита;
	
	Если ПустаяСтрока(Заголовок) Тогда
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;
	
	Возврат НовыйЭлемент; 
	
КонецФункции // СоздатьЭлементФормы(ТекущаяФорма)

Функция ПолучитьИнформациюОКартинках(ОбъектТЗ, ТолькоКоличество = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиОбъектов.НомерПоПорядку КАК НомерПоПорядку,
		|	КартинкиОбъектов.Описание КАК Описание,
		|	КартинкиОбъектов.Картинка КАК Картинка,
		|	КартинкиОбъектов.Расширение КАК Расширение
		|ИЗ
		|	РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|ГДЕ
		|	КартинкиОбъектов.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	Если ТолькоКоличество Тогда
		Возврат Запрос.Выполнить().Выбрать().Количество();
	Иначе
		Запрос.Текст = Запрос.Текст + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерПоПорядку";
		
	КонецЕсли;	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьИнформациюОКартинках()

Функция ПолучитьИнформациюОКартинке(ОбъектТЗ, НомерПоПорядку = 0, Вправо = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА &Вправо
		|			ТОГДА МИНИМУМ(КартинкиОбъектов.НомерПоПорядку)
		|		ИНАЧЕ МАКСИМУМ(КартинкиОбъектов.НомерПоПорядку)
		|	КОНЕЦ КАК НомерПоПорядку
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|ГДЕ
		|	КартинкиОбъектов.ОбъектТЗ = &ОбъектТЗ
		|	И ВЫБОР
		|			КОГДА &Вправо
		|				ТОГДА КартинкиОбъектов.НомерПоПорядку >= &НомерПоПорядку
		|			ИНАЧЕ КартинкиОбъектов.НомерПоПорядку <= &НомерПоПорядку
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КартинкиОбъектов.Описание КАК Описание,
		|	КартинкиОбъектов.Картинка КАК Картинка,
		|	КартинкиОбъектов.Расширение КАК Расширение,
		|	КартинкиОбъектов.ИмяФайла КАК ИмяФайла,
		|	КартинкиОбъектов.Размер КАК Размер
		|ИЗ
		|	вт КАК вт
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|		ПО вт.НомерПоПорядку = КартинкиОбъектов.НомерПоПорядку
		|ГДЕ
		|	КартинкиОбъектов.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", 		ОбъектТЗ);
	Запрос.УстановитьПараметр("НомерПоПорядку", НомерПоПорядку);
	Запрос.УстановитьПараметр("Вправо", 		Вправо);
	
	РезультатЗапроса = Запрос.Выполнить();	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка.Следующий();
	
	СтруктураДанных = Новый Структура();
	
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
	
		ИмяКолонки = Колонка.Имя;          
		Если ИмяКолонки = "Картинка" Тогда
			ЗначениеКолонки = ПоместитьВоВременноеХранилище(Выборка[ИмяКолонки].Получить());
		Иначе              
			ЗначениеКолонки = Выборка[ИмяКолонки];
		КонецЕсли;
		
		СтруктураДанных.Вставить(ИмяКолонки, ЗначениеКолонки);	  
	
	КонецЦикла;
	
	Возврат СтруктураДанных;
	
КонецФункции // ПолучитьИнформациюОКартинках()

Функция СоздатьПрисоединенныйФайл(ОбъектТЗ, ИнформацияОФайле) Экспорт
	
	ХранилищеКартинки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИнформацияОФайле.Адрес), Новый СжатиеДанных(9));
	
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.КартинкиОбъектов");
	ЭлементБлокировки.УстановитьЗначение("ОбъектТЗ", ОбъектТЗ);
	
	НачатьТранзакцию();
	
	Попытка
	
		НомерПоПорядку = ПолучитьСвободныйНомерКартинки(ОбъектТЗ);
		
		Если НомерПоПорядку = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;
														
		МенеджерЗаписи = РегистрыСведений.КартинкиОбъектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбъектТЗ	 		= ОбъектТЗ;
		МенеджерЗаписи.НомерПоПорядку 	= НомерПоПорядку;
		МенеджерЗаписи.Описание 		= ИнформацияОФайле.Описание;
		МенеджерЗаписи.ИмяФайла 		= ИнформацияОФайле.ИмяФайла;
		МенеджерЗаписи.Расширение	 	= ИнформацияОФайле.Расширение;
		МенеджерЗаписи.Размер		 	= ИнформацияОФайле.Размер;
		МенеджерЗаписи.Картинка	 		= ХранилищеКартинки;
		
		МенеджерЗаписи.Записать();
		
		ЗафиксироватьТранзакцию();
	
	Исключение
		
		ОтменитьТранзакцию();
		Возврат Ложь;
		
	КонецПопытки;

	Возврат Истина;

КонецФункции // СоздатьПрисоединенныйФайл()

Функция ПолучитьСвободныйНомерКартинки(ОбъектТЗ)
	
	текущийНомер = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КартинкиОбъектов.НомерПоПорядку КАК НомерПоПорядку
		|ИЗ
		|	РегистрСведений.КартинкиОбъектов КАК КартинкиОбъектов
		|ГДЕ
		|	КартинкиОбъектов.ОбъектТЗ = &ОбъектТЗ";
	
	Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
	
	СуществующиеНомера = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерПоПорядку");
	
	Пока НЕ СуществующиеНомера.Найти(текущийНомер) = Неопределено Цикл
	
		текущийНомер = текущийНомер + 1;	
	
	КонецЦикла;
	
	Возврат текущийНомер;

КонецФункции // ПолучитьСвободныйНомерКартинки()
